docs/class_diagrams/assets/garment_programs/collars.md
```mermaid
classDiagram
    class NoPanelsCollar {
        +interfaces
        +__init__(name, body, design)
        +length()
    }

    class Turtle {
        +interfaces
        +front
        +back
        +stitching_rules
        +__init__(tag, body, design)
        +length()
    }

    class SimpleLapelPanel {
        +edges
        +interfaces
        +__init__(name, length, max_depth)
    }

    class SimpleLapel {
        +interfaces
        +front
        +back
        +stitching_rules
        +__init__(tag, body, design)
        +length()
    }

    class HoodPanel {
        +edges
        +interfaces
        +__init__(name, f_depth, b_depth, f_length, b_length, width, in_length, depth)
    }

    class Hood2Panels {
        +interfaces
        +panel
        +__init__(tag, body, design)
        +length()
    }

    pyg.Component <|-- NoPanelsCollar
    pyg.Component <|-- Turtle
    pyg.Panel <|-- SimpleLapelPanel
    pyg.Component <|-- SimpleLapel
    pyg.Panel <|-- HoodPanel
    pyg.Component <|-- Hood2Panels
```
